In [4]:
import pandas as pd

In [5]:
# Store filepath in a variable
file_three = "Resources/SP500.csv"

In [43]:
SP500_df = pd.read_csv(file_three)
# SP500_df["VALUE"] = SP500_df["VALUE"].map({".": 0})
SP500_df.loc[SP500_df["VALUE"] == ".", 'VALUE'] = 0
SP500_df["VALUE"].apply(float)
SP500_df.head()

         DATE   VALUE
0  2009-01-12  870.26
1  2009-01-13  871.79
2  2009-01-14  842.62
3  2009-01-15  843.74
4  2009-01-16  850.12

In [44]:
SP500_df["YEAR"] = SP500_df["DATE"].map(lambda x: x[:4])
SP500_df.head()

         DATE   VALUE  YEAR
0  2009-01-12  870.26  2009
1  2009-01-13  871.79  2009
2  2009-01-14  842.62  2009
3  2009-01-15  843.74  2009
4  2009-01-16  850.12  2009

In [45]:
SP500_df["MONTH"] = SP500_df["DATE"].map(lambda x: x[5:7])
SP500_df.head()

         DATE   VALUE  YEAR MONTH
0  2009-01-12  870.26  2009    01
1  2009-01-13  871.79  2009    01
2  2009-01-14  842.62  2009    01
3  2009-01-15  843.74  2009    01
4  2009-01-16  850.12  2009    01

In [47]:
SP500_group = SP500_df.groupby("YEAR")

Mean = SP500_group["VALUE"].mean()

DataError: No numeric types to aggregate